goldieswx/node-mcu-connect/msp430/adc-to-slave.c
/*
    node-mcu-connect . node.js UDP Interface for embedded devices.
    Copyright (C) 2013-4 David Jakubowski

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>. 
    



Slave side.

On Power/Reset, goto 0


0  - Reset Watchdog 250ms  
   - "disable" data spi transfer 
   - P1IN can be whatever (not that we have any control on this anyway)
   - set P1OUT low.
   - Start Timer 500ticks (method A)
   - Upon Timer interrupt (method A), 
	run  1. signal = Either (ADC Check or Resend mode).
             2. sample = Sample P1IN
             3. transferTrigger = sample || signal
   - if transferTrigger 
        1aa. HOLd Watchdog
        1a. set P1OUT high
	1b. "reset USCI", prepare exchange buffer
	    "enable data spi transfer"

	---
	2. 
	   on usci interrupt : 
		if data spi enabled, exchange buffers
		Reset watchdog 250ms.
		enable P1IN interrupt
	   on P1IN raising flag: if data spi enabled:
				verify checksums (then set Adc check or Resend mode).
				set P1IN in falling flag
	   then on P1IN falling flag:  
				set P1OUT at low.
				disable this interrupt
				goto 0
   - else 
	
	goto 0


Master side.

   Flags avail.   
	Clear to Send.  (signalMaster & signalMask) == 0;
   Actions avail.
	Signal Master   (signalMaster());
   Events avail.
	Process Buffer (from rbi) (mcomProcessBuffer, busy flag)

   On startup
	SIG to low.

   On (first) sync:
	
	Enable INTR interrupt on raising edge.
	if (INTR (is high) call checkDAC);
   
   On Process Buffer:
	
	Check INTR, 
		if low, set SIG high
			
		else (if high), start timer method A. .
		On: Timer method A. re-exec process buffer action.
   
   INTR interrupt : 
	if (raising edge)
		- clear this interrupt flag	

		/// separate action, checkDAC
		- delay (delta T).  
		- SIG To low
		- delay (delta T/2)
		- prepare and send exchange buffer containing CTS and inbuffer if avail.
		- SIG to hi
		- delay (delta T/2) (verify checksums and clear or not CTS/ set SignalMaster and outbuffer, 
				if failed to send, start timer method A (again))
		- SIG to lo.
                	      
           
*/


#include "msp430g2553.h"
#include <legacymsp430.h>

#define MOSI  BIT7 
#define MISO  BIT6
#define SCK   BIT5

#define CS_NOTIFY_MASTER  BIT2     // External Interrupt INTR = P2.2
#define CS_INCOMING_PACKET  BIT2   // Master enable the line before sending  SIG = P3.2


#define PROCESS_MSG 0x04
#define BEGIN_SAMPLE_DAC 0x02
#define CHECK_DAC 0x01

#define MAX_ADC_CHANNELS 5
#define NUM_PORTS_AVAIL  3

#define PREAMBLE_SIZE 0x01
#define CHECKSUM_SIZE 0x01

#define PREAMBLE 0xACAC

static char ioADCRead[MAX_ADC_CHANNELS]; 
int  adcData [MAX_ADC_CHANNELS+NUM_PORTS_AVAIL + CHECKSUM_SIZE ];
int  exchangeBuffer [PREAMBLE_SIZE + MAX_ADC_CHANNELS+NUM_PORTS_AVAIL + CHECKSUM_SIZE+5]; //  5*2 security bytes just in case
volatile char *  pExchangeBuff=0;



void processMsg();
void checkDAC();

struct ioConfig {
   unsigned char P1DIR;
   unsigned char P1ADC;
   unsigned char P1REN;
   unsigned char P1OUT;
   unsigned char P2DIR;
   unsigned char P2REN;
   unsigned char P2OUT;
   unsigned char P3DIR;
   unsigned char P3REN;
   unsigned char P3OUT;
};

struct flashConfig {
   unsigned int  magic;
   struct ioConfig ioConfig;
   unsigned int  _magic;
};

char availP1 = (BIT0|BIT1|BIT2|BIT3|BIT4);
char availP2 = (BIT3|BIT4|BIT5|BIT6|BIT7);
char availP3 = (BIT3|BIT4|BIT5|BIT6|BIT7);


struct ioConfig ioConfig;
struct flashConfig * flashIoConfig = (struct flashConfig*) 0x0E000;


static volatile int action;
static volatile int timerAction;
static volatile int resample;
static volatile int initialTrigger; // intial trigger upon boot
static volatile unsigned int dataTrigger; // data trigger upon ADC Check
static volatile int transferTrigger; // data trigger || incoming_packet (whether a spi transfer must be triggered right now)

inline unsigned int _memcmp(void* a, void * b, int len) {

  while (len--) {
     if (*(char*)a++ != *(char*)b++) return 0;
  }

  return 1;

}


inline void _memcpy( void* dest, void*src, int len) {

  while (len--) {
     *(char*)dest++ = *(char*)src++;
  }
}

void initConfig() {


    if ((flashIoConfig->magic == 0x4573) && (flashIoConfig->_magic = 0x7354)) {
      _memcpy(&ioConfig,&flashIoConfig->ioConfig,sizeof(struct ioConfig));
    } else {
       ioConfig.P1DIR = 0x03;
       ioConfig.P1ADC = 0x04;
       ioConfig.P1REN = 0xFF;
       ioConfig.P1OUT = 0;
       ioConfig.P2DIR = 0x00;
       ioConfig.P2REN = 0xFF;
       ioConfig.P2OUT = 0;
       ioConfig.P3DIR = 0;
       ioConfig.P3REN = 0xFF;
       ioConfig.P3OUT = 0; 
    }

   ioConfig.P1DIR &= availP1 & ~ioConfig.P1ADC;
   ioConfig.P1ADC &= availP1;
   ioConfig.P1REN &= (availP1 & ~ioConfig.P1ADC & ~ioConfig.P1DIR);
   ioConfig.P1OUT &= (availP1 & ~ioConfig.P1ADC);
   ioConfig.P2DIR &= availP2;
   ioConfig.P2REN &= availP2 & ~ioConfig.P2DIR;
   ioConfig.P2OUT &= availP2;
   ioConfig.P3DIR &= availP3;
   ioConfig.P3REN &= availP3 & ~ioConfig.P3DIR;
   ioConfig.P3OUT &= availP3;
   
   P1DIR    = (P1DIR & (~availP1)) | ioConfig.P1DIR;
   P1SEL    = (P1SEL & (~availP1)) | ioConfig.P1ADC;
   P1SEL2   = (P1SEL2 & (~availP1));
   ADC10AE0 = ioConfig.P1ADC;
   P1REN    = (P1REN & (~availP1)) | ioConfig.P1REN;
   P1OUT    = (P1OUT & (~availP1)) | ioConfig.P1OUT;
   P2DIR    = (P2DIR & (~availP2)) | ioConfig.P2DIR;
   P2REN    = (P2REN & (~availP2)) | ioConfig.P2REN;
   P2OUT    = (P2OUT & (~availP2)) | ioConfig.P2OUT;
   P3DIR    = (P3DIR & (~availP3)) | ioConfig.P3DIR;
   P3REN    = (P3REN & (~availP3)) | ioConfig.P3REN;
   P3OUT    = (P3OUT & (~availP3)) | ioConfig.P3OUT;

   unsigned int i;
   char ioCfg = ioConfig.P1ADC;

    for (i=0;i<MAX_ADC_CHANNELS;i++) {
        ioADCRead[MAX_ADC_CHANNELS-i-1] = ioCfg & 1; 
        ioCfg >>=1;  
    }

}

void beginSampleDac() {

    action &= ~BEGIN_SAMPLE_DAC;

    ADC10CTL0 &= ~ENC;
    while (ADC10CTL1 & BUSY);             // Wait if ADC10 core is active
    ADC10SA = (unsigned int)adcData;      // Copies data in ADC10SA to unsigned int adc array
    ADC10CTL0 |= ENC + ADC10SC;           // Sampling and conversion start

    // Now wait for interrupt.   
}

inline void startTimerSequence() {

    TA0CTL = TASSEL_1 | MC_1 ;             // Clock source ACLK
    TA0CCTL1 = CCIE ;                      // Timer A interrupt enable
}




void flash_erase(int *addr)
{
  __disable_interrupt();                             // Disable interrupts. This is important, otherwise,
                                       // a flash operation in progress while interrupt may
                                       // crash the system.
  while(BUSY & FCTL3);                 // Check if Flash being used
  FCTL2 = FWKEY + FSSEL_1 + FN3;       // Clk = SMCLK/4
  FCTL1 = FWKEY + ERASE;               // Set Erase bit
  FCTL3 = FWKEY;                       // Clear Lock bit
  *addr = 0;                           // Dummy write to erase Flash segment
  while(BUSY & FCTL3);                 // Check if Flash being used
  FCTL1 = FWKEY;                       // Clear WRT bit
  FCTL3 = FWKEY + LOCK;                // Set LOCK bit
  __enable_interrupt();
}

void flash_write(int *dest, int *src, unsigned int size)
{
  __disable_interrupt();                             // Disable interrupts(IAR workbench).
  int i = 0;
  FCTL2 = FWKEY + FSSEL_1 + FN0;       // Clk = SMCLK/4
  FCTL3 = FWKEY;                       // Clear Lock bit
  FCTL1 = FWKEY + WRT;                 // Set WRT bit for write operation
   
  for (i=0; i< size; i++)
      *dest++ = *src++;         // copy value to flash
   
 
  FCTL1 = FWKEY;                        // Clear WRT bit
  FCTL3 = FWKEY + LOCK;                 // Set LOCK bit
  __enable_interrupt();
}

void flashConfig(struct ioConfig * p) {

    WDTCTL = WDTPW + WDTHOLD;
    struct flashConfig buffer;
    buffer.magic = 0x4573;
    buffer._magic = 0x7354;
    _memcpy(&buffer.ioConfig,p,sizeof(struct ioConfig));

    if (_memcmp(&buffer,flashIoConfig,sizeof(struct flashConfig))) {
      return;
    }

    flash_erase((int*)flashIoConfig);
    flash_write((int*)flashIoConfig,(int*)&buffer,sizeof(struct flashConfig)/sizeof(int));

    WDTCTL = WDTHOLD; // reboot.
}


void resetUSCI() {

  UCA0CTL1 = UCSWRST;   
  UCB0CTL1 = UCSWRST;                       // **Put state machine in reset**
  __delay_cycles(10);
  UCB0CTL0 |= UCCKPH   + UCCKPL + UCMSB + UCSYNC;     // 3-pin, 8-bit SPI slave
  UCB0CTL1 &= ~UCSWRST;                     // **Initialize USCI state machine**

  while(IFG2 & UCB0RXIFG);                  // Wait ifg2 flag on rx 
  IE2 |= UCB0RXIE;                          // Enable USCI0 RX interrupt
  UCB0TXBUF = 0x00;                         // We do not want to ouput anything on the line

}

inline void disableUSCI() {
  
  //UCA0CTL1 = UCSWRST;   
  //UCB0CTL1 = UCSWRST;                       // **Put state machine in reset**
  //IE2 &= ~UCB0RXIE;

}


void initUSCI() {

  P1DIR   |=    BIT5 |/*+ BIT6 +*/ BIT7;
  P1DIR   &= ~BIT6;
  P1SEL  |=    BIT5 + BIT6 + BIT7; 
  P1SEL2 |=    BIT5 + BIT6 + BIT7;

  P2DIR  &= ~CS_INCOMING_PACKET;
  P2OUT  &= ~CS_INCOMING_PACKET;
  P2REN  &= ~CS_INCOMING_PACKET;
  P2SEL  &= ~CS_INCOMING_PACKET;
  P2SEL2 &= ~CS_INCOMING_PACKET;

  //P2IE  = CS_INCOMING_PACKET;
  P2IES = 0;
  P2IFG = 0;

  P3DIR  |= CS_NOTIFY_MASTER;
  P3OUT  &= ~CS_NOTIFY_MASTER;
  P3REN  &= ~CS_NOTIFY_MASTER;
  P3SEL  &= ~CS_NOTIFY_MASTER;
  P3SEL2 &= ~CS_NOTIFY_MASTER; 


}


void initADC() {

  ADC10AE0    = 0;
  ADC10CTL0   = 0;
  ADC10CTL1   = 0;
  ADC10MEM    = 0;
  ADC10DTC0   = 0;
  ADC10DTC1   = 0;

  ADC10CTL0 = SREF_0 + ADC10SHT_2 + MSC + ADC10ON + ADC10IE;  // Vcc,Vss as ref. Sample and hold 64 cycles
  ADC10CTL1 = INCH_4 + CONSEQ_1 ;         // Channel 3, ADC10CLK/3
  ADC10AE0 = ioConfig.P1ADC;
  ADC10DTC1 = 5;                         // 5 conversions
}

void initTimer() {
  TA0R = 0;
  TA0CCR0 = 80;                         // Count to this, then interrupt;  

}


void beginCycle() {


  initTimer();   //  initializes the timer (80 clicks at 10khz)
  
  P3OUT  &= ~CS_NOTIFY_MASTER;
  timerAction = 0x01; 
  WDTCTL = WDT_ARST_16; // 16ms*3.2768 = 52ms
  startTimerSequence();  // start timer and enable interrupt


}


int main(void)
{

  WDTCTL = WDTPW | WDTHOLD; /*WDT_ARST_1000*/
  BCSCTL1 = CALBC1_8MHZ;           // DCOCTL = CALDCO_1MHZ;
  BCSCTL2 |= DIVS_3;            // SMCLK/DCO @ 1MHz
  BCSCTL3 = LFXT1S_2; 

  initConfig();
  initUSCI();
  initADC();
  resetUSCI();

  timerAction = 0;
  resample = 1;
  initialTrigger = 1;
  dataTrigger = 0;
  
  beginCycle();


  while(1)    {
      if (!action) {
          __bis_SR_register(LPM3_bits + GIE);
      }
      __enable_interrupt(); // process pending interrupts (between actions)
      __delay_cycles(100);
      __disable_interrupt(); 
      
      if(action & CHECK_DAC) {
          checkDAC();
          continue;
      }
      if(action & BEGIN_SAMPLE_DAC) {
          beginSampleDac();
          continue;
      }
      if(action & PROCESS_MSG) {
          processMsg();
          continue;
      }
  }
}
 

void checkDAC() {

    action &= ~CHECK_DAC;  
    WDTCTL = WDTPW + WDTHOLD;

    static int lastValues[5];
    static char lastP1, lastP2, lastP3;

    char newP1,newP2,newP3;

    int readValue;
    unsigned int i;

    if (resample) {
      
      dataTrigger = 0;
      for (i=0;i<MAX_ADC_CHANNELS;i++) {
        if (ioADCRead[i]) {
           readValue = adcData[i];
           if (readValue < 750) {
              if ((readValue > (lastValues[i]+15)) || (readValue < (lastValues[i]-15))) {
                  lastValues[i] = readValue;
                  dataTrigger |= 0x01 << i;
              }
           }
        }
      }

     newP1 = availP1 & (P1IN & ~ioConfig.P1DIR & ~ioConfig.P1ADC);
     newP2 = availP2 & (P2IN & ~ioConfig.P2DIR);
     newP3 = availP3 & (P3IN & ~ioConfig.P3DIR);

     dataTrigger |= (initialTrigger << 8);
     initialTrigger = 0;

     if (lastP1 != newP1) { dataTrigger |= 0x01 << 0x05; lastP1 = newP1; }
     if (lastP2 != newP2) { dataTrigger |= 0x01 << 0x06; lastP2 = newP2; }
     if (lastP3 != newP3) { dataTrigger |= 0x01 << 0x07; lastP3 = newP3; }

    int * pAdcData = &adcData[MAX_ADC_CHANNELS];

    if (dataTrigger) {
        *pAdcData++ = newP1 | newP2 << 0x08;
        //*pAdcData++ = newP3;
        *pAdcData++ = dataTrigger;
         adcData[0] &= ~0x0080;
    } else {
          adcData[0] |= 0x0080; // buffer contains data to discard
    }

    
  }

   transferTrigger = dataTrigger || (P2IN & CS_INCOMING_PACKET);

   if (transferTrigger) {

     P3OUT |= CS_NOTIFY_MASTER;

    /* prepare exchangeBuffer for sending */
        unsigned long int chkSum = 0;
        for(i=0;i<MAX_ADC_CHANNELS+NUM_PORTS_AVAIL;i++) {
          chkSum += adcData[i];
        }

        _memcpy(exchangeBuffer+1,adcData,(MAX_ADC_CHANNELS+NUM_PORTS_AVAIL)*sizeof(int));
        exchangeBuffer[0] = PREAMBLE;
        exchangeBuffer[MAX_ADC_CHANNELS+NUM_PORTS_AVAIL+1] = chkSum & 0xFFFF;

    /* prepare usci */
     WDTCTL = WDT_ARST_16; // release the dog
     pExchangeBuff = (char*)exchangeBuffer;
     
     resetUSCI();
     UCB0RXBUF;
     IFG2 &= ~UCB0RXIFG;
     UCB0TXBUF = * pExchangeBuff++;

     /* wait for usci interrupt */   

  } else { 
     WDTCTL = WDTPW + WDTCNTCL;
     beginCycle();
  }
  return;
}


/* PROCESS RECEIVED MSG */
void processMsg () {

    action &= ~PROCESS_MSG;

    WDTCTL = WDTPW + WDTCNTCL;
    if (exchangeBuffer[0] != PREAMBLE) { // just checking this for now. 
       //resample = 0;
       //initUSCI()
       //P1OUT ^= BIT1;

    } else {
      resample = 1;
      char * pXchBuf = (char*)&exchangeBuffer[PREAMBLE_SIZE];
      switch (*++pXchBuf) {
          case  0x55 :
         //     flashConfig((struct ioConfig*)++pXchBuf);
         //     break;
          break;
        
          case 0x66 :
         // P1OUT ^= BIT0;
     
          P1OUT |= (*++pXchBuf & ioConfig.P1DIR);
          P2OUT |= (*++pXchBuf & ioConfig.P2DIR);
          P3OUT |= (*++pXchBuf & ioConfig.P3DIR);
          P1OUT &= (*++pXchBuf | ~ioConfig.P1DIR);
          P2OUT &= (*++pXchBuf | ~ioConfig.P2DIR);
          P3OUT &= (*++pXchBuf | ~ioConfig.P3DIR);
        break;
      }
    }
    resample = 1;

    beginCycle();

}

interrupt(ADC10_VECTOR) ADC10_ISR (void) { 
   
  action |= CHECK_DAC;
  ADC10CTL0 &= ~ADC10IFG;
  __bic_SR_register_on_exit(LPM3_bits + GIE); // exit LPM   
  return;

}
 
interrupt(USCIAB0RX_VECTOR) USCI0RX_ISR(void) {

  if (P3OUT & CS_NOTIFY_MASTER) {
      UCB0TXBUF = *pExchangeBuff;
      *pExchangeBuff = UCB0RXBUF;
      pExchangeBuff++;



      // and the last byte...
      if (P2IN & CS_INCOMING_PACKET) {
        //P1OUT ^= BIT1;
        //disableUSCI();
        P3OUT &= ~CS_NOTIFY_MASTER;
        action |= PROCESS_MSG;
        __bic_SR_register_on_exit(LPM3_bits + GIE); // exit LPM
      }
  } else {
    UCB0TXBUF = 0x99;
    IFG2 &= ~UCB0RXIFG;
  }

  return;
}



interrupt(TIMER0_A1_VECTOR) ta1_isr(void) {

  TA0CTL = TACLR;  // stop & clear timer
  TA0CCTL1 &= 0;   // also disable timer interrupt & clear flag

  switch(timerAction) {
    case 0x01:
      if (resample)  {
         action |= BEGIN_SAMPLE_DAC; 
      } else {
         action |= CHECK_DAC;
      }
      break;

  }
    __bic_SR_register_on_exit(LPM3_bits + GIE); // exit LPM


  return;
} 
